#+TITLE: JavaScript Api
#+DATE: <2020-09-03 16:20:35>
#+TAGS[]: javascript, api
#+CATEGORIES[]: javascript
#+LANGUAGE: zh-cn
#+STARTUP: indent ^:{}

#+begin_quote
1. *regenerator*: ~npm install -g renerator~ 将 es6+ 语法编译成 es5 语法
#+end_quote
** Exponentiation Operator(幂运算符)@@html:<font color='red'>@@^{s3}@@html:</font>@@ 
:PROPERTIES:
:COLUMNS: %CUSTOM_ID[(Custom Id)]
:CUSTOM_ID: es2106-expo-operator
:END: 

#+begin_src js
  let squared = 2 ** 2

  let cubed = 2 ** 3

  let a = 2
  a **= 2

  let b = 3
  b **= 3
  console.log({ squared, cubed, a, b })
#+end_src

#+RESULTS:
: { squared: 4, cubed: 8, a: 4, b: 27 }

[[https://github.com/tc39/proposal-exponentiation-operator][more...]]
